package HomeWork3;
// 1.	Напишите программу на Java, чтобы получить символ по указанному индексу в строке
public class Home1 {
    public static void main(String[] args) {
        String str1 = "упражнения Java!";

        System.out.println(str1.charAt(0));
        System.out.println(str1.charAt(11));
    }

}
