package HomeWork3;
// Напишите Java-программу для подсчета количества кодовых точек Unicode в указанном текстовом диапазоне строки.
public class Home4 {
    public static void main(String[] args) {
        String str1 = "w3resource.com";
        String sub = str1.substring(2,6);
        System.out.println(sub.length());

    }
}
